## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
sns.tf
```
```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                |
|--------|------------------------------------|
| update | `aws_sns_topic.cloudwatch_warning` |
| add    | `aws_kms_key.sns_cloudwatch`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_kms_key.sns_cloudwatch will be created
  + resource "aws_kms_key" "sns_cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::307395567143:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_sns_topic.cloudwatch_warning will be updated in-place
  ~ resource "aws_sns_topic" "cloudwatch_warning" {
        id                                       = "arn:aws:sns:ca-central-1:307395567143:gc-design-system-cloudwatch-alarms-warning"
      + kms_master_key_id                        = (known after apply)
        name                                     = "gc-design-system-cloudwatch-alarms-warning"
        tags                                     = {
            "CostCentre" = "gc-design-system-production"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.gc_design_system_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.gc_design_system_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.gc_design_system_error"]

22 tests, 18 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
